Repository: yshialexandra/Optimizing_LLM_Chinese_Translation_through_Syntactic_Feature_Extraction_and_Representation_Editing
Catalog: yshibachlorpaper/Yiyan_tmx/F07.tmx
Source language: en_us
Languages: zh_cn

source: A second life
zh_cn: 第二次生命

source: The sun is barely up on this November morning, but already Matt Long is in a rush.
zh_cn: 11月的清晨，太阳还没升起，但MattLong已经匆匆上路了。

source: The career fireman knows the importance of moving fast: It can save a life.
zh_cn: 作为职业消防员，他深刻理解“快速行进”的意义：可以挽救生命。

source: Today, however, he can't seem to move quick enough.
zh_cn: 然而今天，看起来他“行进”的并不够快。

source: It took 10 stressful minutes to find the disabled-athlete starting area for the ING New York City Marathon.
zh_cn: 他紧张的足足用了10分钟，才找到ING纽约马拉松残疾人起跑的集合点。

source: Until three years ago, he'd never have imagined lining up for a race alongside people who are blind or depend on crutches or sit in wheelchairs - and who will get a three-hour head start on the field.
zh_cn: 三年前，他还难以想象自己有朝一日会同一票盲人、拄拐的人、坐在轮椅上的人排在一起参加比赛-而且将会在赛场上提早3小时出发。

source: But those three years have been packed with humbling surprises.
zh_cn: 但是这3年已经挤满了大小各种令人意外的事。

source: Long is flanked by two longtime buddies, fellow fireman Frank Carino and Noel Flynn, who works at a Manhattan hedge fund.
zh_cn: 陪伴在Long两侧的是两位长期以来的好友，消防队同事Frank Carino以及马拉松基金会的Noel Flynn。

source: Carino has done an 11-hour Ironman triathlon, while Flynn is on the cusp of a sub-three-hour marathon. Still, they've agreed to hang with their friend, step by step, for a very slow run through New York City.
zh_cn: Carino曾经完成过11小时的超级铁人三项赛，而Flynn则是一名实力在3小时以内的马拉松选手，但他们仍然同意与朋友并肩，一步一步，非常缓慢的跑完这次纽约马拉松。

source: It could take eight or nine hours.
zh_cn: 整个耗时可能达到8个或9个小时。

source: Long's really not sure.
zh_cn: Long本人也不太确定。

source: All he knows is that until he finishes, his exhausting battle to restore his body, his identity, and his connections to loved ones won't be complete either.
zh_cn: 但他明白的是，除非他完成比赛，否则他之前为恢复身体所付出的各种艰苦努力，他的个性，以及他与亲人之间的关联将不再是完整的。

source: Long wobbles over to a police barricade to stretch his legs. He adjusts his black skullcap. Then he gives his knee-high compression socks a final tug.
zh_cn: Long蹒跚着走到警察隔离栏前拉伸双腿，整理了一下帽子，最后一次拉了拉长达膝上的高压缩性袜子。

source: He hopes they'll give his battered legs some extra support.
zh_cn: 他希望这双袜子能够给他倾斜的双腿额外的支撑。

source: Long's friends take note - and let him have it.
zh_cn: Long的朋友们赛前做了一些调查-坚持让他穿这种袜子。

source: "Yo, Frank," says Flynn. "Check out Matty's legs."
zh_cn: “哟，Frank，”Flynn说“看看Matty的这双腿。”

source: "Very nice, Matty," says Carino. "Ya look like Paula Radcliffe."
zh_cn: “很漂亮，Matty，”Carino说道，“你看起来就像Paula Radcliffe。”

source: For a while, Long joins in as the jokes fly, but he has other things on his mind.
zh_cn: Long也跟着讲了一阵笑话，但他心中还有别的心事。

source: The fast-talking, hard-charging fireman is about to run the slowest race of his life, and even if he finishes, he's surely going to suffer.
zh_cn: 这位语速快、能力强的消防员将要进行的，是人生中最慢的一次跑步比赛，而且，即便他能完成，也将注定饱受考验。

source: He paces around like his life depends on what happens over the next 26 miles.
zh_cn: 他来回踱步，仿佛未来的人生就取决于接下来的26英里。

source: And maybe it does.
zh_cn: 也可能的确如此。

source: On December 22, 2005, New York City woke up to 28¡ãF temperatures and day three of a transit strike.
zh_cn: 2005年12月22号，纽约市28华氏度，交通大罢工第3天。

source: For 48 hours, the 33,000-person Transport Workers Union had violated a state law prohibiting city employees from staging a job action.
zh_cn: 在过去的48小时，拥有3万3千人的交通工人工会使用违法行为，发动临时大罢工，妨碍了城市里的各种上班族赶工。

source: Union and city negotiators kept bargaining, but no settlement was in sight.
zh_cn: 工会和城市谈判代表持续交涉，但协议无望。

source: The strike forced New Yorkers to find new ways to get around.
zh_cn: 这场罢工致使纽约市民不得不另寻他径才能出门。

source: Matt Long was among them.
zh_cn: Matt Long也是受害者之一。

source: That morning around 5:30, the 12-year veteran of the New York City Fire Department left his apartment on East 48th Street on his road bike, wearing a ski mask and a red and silver jacket over a winter biking kit. He had a 20-minute ride ahead of him, to the Rock on Randall's Island.
zh_cn: 那天早上大约5点半，这位有着12年丰富工作经验的纽约消防员，骑着他的公路车离开了位于东48街的家。他戴着滑雪面罩，红银的外套裹在冬季骑行套装外面，目的地是Randall岛上的Rock中心，他需要骑20分钟。

source: The Rock is shorthand for the FDNY's training academy.
zh_cn: Rock是纽约消防局训练中心的简写。

source: It's where probation officers go to see if they can make it onto the nation's largest fire-fighting department.
zh_cn: 试用期的消防员在这里接受考核，以决定他们能否最终加入到这个全国最大的消防局。

source: The Rock resembles a Hollywood back lot, 22 acres dotted with faux walk-ups and high-rises.
zh_cn: Rock中心像是一个好莱坞的外景地，22英亩的范围内遍布着人造的无电梯楼房和大厦。

source: For six months, probies haul hoses up and down stairs with up to 100 pounds on their backs.
zh_cn: 有6个月的时间，试训队员在这里背着重达100磅的软管上下楼梯。

source: They crawl through dark tunnels while breathing through oxygen masks.
zh_cn: 他们带着氧气面罩爬过深暗的隧道。

source: They do whatever they're told so they're ready when a fire alarm goes off.
zh_cn: 他们要完成所有指令，只有这样，当火警响起时，他们才能胜任。

source: It was the next-to-last day of Long's yearlong assignment with the academy's health and fitness squad. His job was to ensure probies were physically prepared to graduate and save lives.
zh_cn: 这天是Long在这所学校的卫生队履行职责的倒数第2天，这种工作每年一次，他的任务是确保试训队员在毕业赶赴火场前，在身体上先做好准备。

source: He was planning to take a week of vacation, then return to his permanent job at Engine Company 53, Ladder 43, in East Harlem.
zh_cn: 他本打算工作结束后休息一周，然后回到平时的工作单位，位于东哈勒姆区消防43大队的第53中队。

source: Long, 39 at the time, fit in perfectly at the Rock.
zh_cn: Long当时39岁，在Rock中心处的很好。

source: He was relentlessly upbeat and radiated strength.
zh_cn: 他时刻保持着乐观，并向四周不断散射着力量。

source: He came from blue-collar Bay Ridge, Brooklyn, and a family with eight siblings.
zh_cn: 他出生在布鲁克林的蓝领社区Bay Ridge，有8个兄弟姊妹。

source: He had two brothers in the FDNY.
zh_cn: 他有2个兄弟都在纽约消防局工作。

source: Long had worked amid the chaos at Ground Zero on 9/11.
zh_cn: 911的时候，他曾在混乱的世贸大厦“归零地”执行任务。

source: And he had a "save" to his credit.
zh_cn: 曾经有一次的“施救”是他最大的光荣。

source: On Christmas Eve 2000, his company responded to a fire in a tenement that was thought to be abandoned.
zh_cn: 2000年的圣诞前夜，他的中队参与了一处救火任务。

source: But while putting out the fire, Long saw a stack of mail in front of one apartment. So, he entered the unit and found an elderly man unconscious on the floor.
zh_cn: 当时的起火地点是一处廉价公寓，人们以为这个公寓早已被人遗弃，但当火被扑灭之后，Long在一个门口发现一摞信件，因此他冲了进去，发现一个躺在地上已经失去意识的老人。

source: With another firefighter's help, he dragged the man to safety.
zh_cn: 在另一名消防员的帮助下，他们把老人带到了安全地带。

source: While at the Rock, Long worked himself into the best shape of his life.
zh_cn: 在Rock中心那段时间，Long通过锻炼身体达到了他一生中的最佳状态。

source: He had only been biking and running seriously for a year and a half; he got into the sports when he was having back pain and a doctor urged him to lose some of the 212 pounds he was carrying on his 5'11" frame.
zh_cn: 他只不过是参加了1年半的自行车和跑步运动；这还是因为他当时后背疼去看医生，他5英尺11寸，体重212磅，医生命令他减掉一些体重。

source: Within a few months, he was down 30 pounds, over the back pain, and suddenly addicted to triathlons.
zh_cn: 仅仅几个月的时间，他减掉了30磅，不仅后背疼痛就此消失，他还爱上了铁人三项赛。

source: In fact, he competed in more than 20 events of various distances over an 18-month span.
zh_cn: 事实上，在18个月的时间里，他完成了各种距离，总共超过20项比赛。

source: "The adrenaline rush - I loved it," he says. "It was like rushing to a fire.
zh_cn: “肾上腺素飙升-我喜欢这种感觉，”他说，“这就像是奔向火场去救火。

source: I was hooked."
zh_cn: 我简直入迷了。”

source: So it was little surprise Long would attempt - and finish - his first Ironman triathlon, a 2.4-mile swim, 112-mile bike, and 26.2-mile run, in Lake Placid, New York, in July 2005.
zh_cn: 所以，Long能参加-并且完赛-于2005年7月在纽约Placid湖举行的超级铁人三项赛（2.4英里游泳，112英里自行车，26.2英里跑步）并不为奇。

source: He finished in 11 hours and 18 minutes, placing in the top 20 percent for his age group and running the marathon leg in 3:44:38.
zh_cn: 他比赛成绩是11小时18分，排在同年龄组的前20%，而且最后的马拉松跑成绩是3小时44分38秒。

source: Next, Long set his sights on the 2005 New York City Marathon.
zh_cn: Long就把目光对准了2005年纽约马拉松比赛。

source: But not just to run it. He wanted to go 3:15 and qualify for Boston.
zh_cn: 不仅仅是只求完赛，他把目标定在3小时15分，希望取得波士顿马拉松的参赛资格。

source: In August, Long began running workdays at 6 a.m. with three trainers at the Rock: Tommy Grimshaw, Shane McKeon, and Larry Parker.
zh_cn: 那年8月，Long每天早上6点开始练习跑步，和他一起的还有三个人，分别是Tommy Grimshaw, Shane McKeon和Larry Parker。

source: No day was a gimme.
zh_cn: 没有一天是轻松了事。

source: On Mondays and Wednesdays they ran 12 miles, pushing eight of those at a 6:15 clip.
zh_cn: 周一和周三，他们跑12英里，其中8英里的每英里配速是6分15。

source: Tuesdays and Thursdays were easy eight-milers.
zh_cn: 周二和周四是轻松的8英里跑。

source: And Friday was an 18-miler, with miles four to 12 at a six-minute pace.
zh_cn: 周五是18英里长跑，其中4到12英里是用6分的配速。

source: At first, Long couldn't keep up.
zh_cn: 一开始，Long坚持不下来。

source: "But after a month, Matty wasn't far behind us.
zh_cn: “但一个月以后，Matty落后我们并不远了。

source: Pretty soon he was sticking with us," says McKeon. "We pushed each other; our goal was for all of us to qualify for Boston."
zh_cn: 很快，他就能跟住我们了，”McKeon说，“我们互相鼓励；我们的目标是全部获得波士顿马拉松比赛资格。”

source: As it turned out, all four made it.
zh_cn: 最后的结果是，他们4个都取得了资格。

source: Long went 3:13:59, good enough to place fourth among the 201 New York firefighters who ran.
zh_cn: Long跑了3小时13分59秒，排在201名参加纽约马拉松的消防员的第4名。

source: They'd start ramping up for Boston right after New Year's.
zh_cn: 新年一过，他们就快马加鞭的开始准备波士顿马拉松了。

source: Today, on this frigid morning, three days before Christmas, a light swim was in store.
zh_cn: 今天，在这个冰冷的早晨，圣诞节的前三天。

source: McKeon, Grimshaw, and Parker waited at the Rock as Matt Long started to cycle up Third Avenue.
zh_cn: McKeon、Grimshaw和Parker在Rock中心焦急等待着，而MattLong已经开始绕上第3大道了。

source: "Hey, how did we do with that first mile?"
zh_cn: “嘿，刚才的这第一个1英里，我们什么速度？”

source: "Around 17:30.
zh_cn: “大概17分30秒。

source: That work for you, Matt?"
zh_cn: 你觉得这样怎么样，Matt？”

source: "Yeah, pretty close to what I expected."
zh_cn: “不错，跟我想的差不多。”

source: By now Long, Carino, and Flynn are halfway across the Verrazano-Narrows Bridge.
zh_cn: 此时，Long、Carino和Flynn已经跑过了一半的Verrazano-Narrows大桥。

source: To their left, Manhattan's skyline is backlit in light blue.
zh_cn: 在他们左手边，曼哈顿的天际线像是从后面打了淡蓝色的背光。

source: In front of them, there's nothing but the metal skyway.
zh_cn: 在他们前面，则是无尽的钢筋森林。

source: The other early starters are out of sight, having rushed off on crutches and in chairs.
zh_cn: 其他一同起跑的人已经消失在眼前，他们或拄着拐、或坐着轮椅冲了出去。

source: When Long ran here in 2005, he did the first mile in an easy 7:40.
zh_cn: 而2005年的时候，Long在这里跑的第一个1英里是轻松的7分40秒。

source: Today he stutters across the span, his brawny shoulders listing and lurching side to side.
zh_cn: 今天，他只能算是一点一点的挪，他结实有力的肩膀则上下左右一晃一晃。

source: As he pushes off his left leg, the one filled with titanium, the three grossly distorted hammer toes on his left foot jab into the ground.
zh_cn: 每当他往前推进一步那带有钛合金钢钉的左腿，其中3个裸露扭曲成锤子样的脚趾就深深的扎入地面。

source: His right leg, two inches shorter than his left, follows in a contorted motion, barely bending as he forces his foot forward.
zh_cn: 而他的右腿则比左腿短了足有2英寸，致使当他跟上左腿挪步的时候，整个身子都要扭一下，而且这整个过程，右腿几乎都没有弯曲。

source: Each step consumes inches, not feet.
zh_cn: 每一步也就是挪几寸，而非能以尺来计算。

source: The bus moved up Third Avenue, two lanes over from the shoulder where Matt Long and his bike were gaining speed.
zh_cn: 那辆巴士从第3大道一路开来，与路肩有2车道距离，而MattLong就在这路肩附近加速骑行。

source: It wasn't a typical city bus. A brokerage firm, Bear Stearns, had hired the coach to transport employees to work during the transit strike.
zh_cn: 那甚至不是一辆普通的城市巴士，而是一家叫做贝尔斯登的经济公司，在交通大罢工的时候雇来的大客车运载其员工通勤。

source: The driver was from Albany, so maybe he didn't know that making turns outside of the marked bus lane was prohibited by law.
zh_cn: 巴士司机来自奥尔巴尼镇，所以大概他也不知道，在巴士特定行车道以外的路面拐弯是违法行为。

source: Or perhaps he just didn't see the biker.
zh_cn: 或者，也许仅仅是他没看到这个骑自行车的人。

source: Whatever the reason, the bus started turning right onto 52nd Street - and right into Matt Long.
zh_cn: 无论如何，这辆巴士开始要右拐上52街，正好撞倒了MattLong。

source: Later, one cop at the scene would wonder why the biker didn't ricochet backward on impact. That's what typically happens in a collision like this.
zh_cn: 后来，当时在场的一名警察好奇的表示，骑自行车的人竟然没有像通常会发生的那样，在当下的冲击中被撞飞。

source: But when Long crashed into the bus, he got vacuumed underneath.
zh_cn: 但当Long撞上巴士的时候，他被真空般吸在了汽车底下。

source: By the time the bus came to a stop, Long and his bike were twisted near the rear axle.
zh_cn: 直到大巴停下，Long和他的自行车被扭曲得压在车后轴的地方。

source: The bike's handlebars got jammed into the coach's metal base and speared Long, opening a fissure from his belly button to his rectum.
zh_cn: 自行车的车把挤进了大巴的金属底盘，并且刺进了Long的身体，从他的肚脐到直肠划了一个大口子。

source: Blood slid from under the vehicle and began pooling near the corner.
zh_cn: 鲜血从车底下溢出，铺满了附近的街角。

source: A police officer happened to be nearby and called for backup.
zh_cn: 一名警察当时碰巧在附近，他呼叫并请求了支援。

source: The NYPD's Emergency Service Unit arrived four minutes later.
zh_cn: 4分钟后，纽约警察局的紧急服务队赶到了现场。

source: One detective, Charles King, went to work lifting the front of the bus with a hydraulic jack, while two others, Ralph Logan and Charlie Raz, crawled under.
zh_cn: 其中一名叫CharlesKing的警察用液压千斤顶抬起巴士的前半部分，另外两名警察，RalphLogan和CharlieRaz则顺势从下面爬了进去。

source: They heard Long moan, "so we knew he was alive," recalls Logan.
zh_cn: 他们当时听到Long在呻吟，“所以我们知道他还活着，”Logan回忆道。

source: They yelled out for a portable saw so they could cut the handlebars from the bus and Long's stomach.
zh_cn: 他们喊着找来了一把便携锯，试图将自行车车把从巴士和Long的肚子上切下来。

source: But because of the blood gushing from Long's midsection, "it was like an oil slick under there," Logan says. "I had to wedge my feet up on the bottom of the bus to keep from sliding."
zh_cn: 但因为Long的腹部不断出血，“那下面就像水面上的浮油一样”，Logan说，“我得使劲用脚顶着汽车的底部防滑。”

source: As the officers sawed, firefighters from a midtown station arrived.
zh_cn: 在警察切割的时候，来自中城分局的消防员赶到了现场。

source: One of them, Donal Buckley, crawled under the bus to help.
zh_cn: 其中，一名叫DonalBuckley的消防员也爬进去帮忙。

source: He grabbed the bike frame, steadying it as officers kept sawing.
zh_cn: 他抓住了自行车的大梁，稳住了自行车，以便警察进行切割。

source: It took a couple of minutes for the officers to free Long.
zh_cn: 用了若干时间，警察才把Long救了出来。

source: They rolled him onto a backboard, pushed him from under the bus, and lifted him onto a gurney.
zh_cn: 他们把他滚到后挡板上，从巴士底下推了出来，然后抬到了担架上。

source: At that point, Long was drifting in and out of consciousness, though he managed to mouth the word forty.
zh_cn: 那时候，Long徘徊在忽而有意识、忽而昏迷的状态，但他还是从嘴里说出了“40”这个词。

source: Buckley looked at his face; it was pasty white but familiar.
zh_cn: Buckley看了看他的脸，非常惨白但是很眼熟。

source: He remembered a fireman who used to park his car in front of his firehouse to run in nearby Central Park.
zh_cn: 他记起来，曾经有个消防员习惯把车停在他们消防站前面，然后到附近的中央公园跑步。

source: "Hey," Buckley blurted. "That's Matty Long, from Ladder 43."
zh_cn: “嘿，”Buckley脱口而出，“这是MattyLong，消防43大队的。”

source: As Long, Carino, and Flynn stutter down the ramp off the Verrazano and start looping into Brooklyn, Long says, "I used to come out every year and watch this race.
zh_cn: 当Long,Carino和Flynn三个人跑完了Verranzano地段的比赛，开始跑入布鲁克林区的循环路段时，Long说道：“以前，每年纽约马拉松的时候，我都过来看比赛。

source: Never missed it."
zh_cn: 从来没缺席。

source: Bay Ridge is the first neighborhood runners hit after the bridge. Long's family moved there when he was a teenager.
zh_cn: “BayRidge地区是参赛的跑者们完成大桥之后遇到的第一个居民区，在Long还小的时候，他们一家曾经搬到了这里居住。

source: In a few hours, locals will line Fourth Avenue, cheering on a sea of marathoners.
zh_cn: 在未来几个小时之内，当地的居民会在第4大道排成一排，给跑马的众人加油鼓劲。

source: But now, the street is practically empty except for a clump of about 40 people waiting in front of Our Lady of Angels Church near the three-mile mark.
zh_cn: 但此刻，这里却一片冷清，只有大约40个人簇拥在OurLadyofAngels教堂门前，差不多靠近3英里标志牌的位置。

source: It's Long's family and friends.
zh_cn: 他们都是Long的家人和朋友。

source: Matt told his mom and dad that he'd stop for exactly 90 seconds - enough time for them to snap a few pictures.
zh_cn: Long赛前告诉父母说，他们会在这里停留片刻，90秒，不多不少，但足够用来拍照留念。

source: The noise grows until Long shuffles to a stop in front of his parents, and hugs them.
zh_cn: 人群欢呼雀跃，Long则来到了父母面前，拥抱了他们。

source: His two sisters, Maureen and Eileen, hold their kids, and cry.
zh_cn: 他的两个姐姐，Maureen和Eileen，分别抱着他们孩子，忍不住哭了起来。

source: Some of his brothers and nephews hold signs that say "Matty, We Love You" and "Matty, You Will."
zh_cn: 他的一些兄弟和亲戚则举着标语，上面写着“Matty，我们爱你”以及“Matty，你能。”

source: The 90 seconds pass quickly.
zh_cn: 短暂的90秒。

source: Long tells his family he has to go.
zh_cn: Long告诉家人他还得上路。

source: A block later, he turns to his left. He's tearing up.
zh_cn: 接下来，跑过了一个街区，他转到了左边，泪水盈眶。

source: "Hey, Frank."
zh_cn: “嘿，Frank。”

source: "Yeah, Matt."
zh_cn: “怎么了，Matt。”

source: "The allergies, bro. They're starting to kick in."
zh_cn: “没事，过敏而已。刚有点反应。”

source: "Take it slow, bro. Take it slow."
zh_cn: “慢慢来吧。慢慢来。”

source: Most mornings, Dr. Soumitra R. Eachempati, a trauma surgeon at New York-Presbyterian Hospital on Manhattan's Upper East Side, walks to work from his nearby apartment.
zh_cn: SoumitraR.Eachempati是曼哈顿上东区纽约长老会医院的一名创伤科医生，他就住在医院附近，所以，早上一般他都是从家里走过去上班。

source: On this day, however, he walked a bit faster after getting a call from the ER about a biker who'd been carved open by a bus.
zh_cn: 但那天早上，他走的匆匆忙忙，因为他刚刚接到急诊室的电话，一个骑自行车的人被巴士严重撞伤。

source: Orthopedic surgeon Dr. Dean Lorich had a trickier commute. He lives 20 blocks from the hospital.
zh_cn: DeanLorich则是医院的骨科医师。因为住在离医院20个街区之外的地方，所以他日常通勤则并不轻松。

source: Because of the transit strike, police were restricting cars or taxis with fewer than four passengers. So to get to work that day, Lorich had to fill a cab with his pregnant wife and two young daughters.
zh_cn: 因为交通大罢工，警察限制搭载少于4人旅客的汽车或者计程车行车，所以，当天为了赶到医院，Lorich医生不得不打车，并带上怀孕的太太和他们的两个女儿。
